package il.ac.huji.mineralyzer;

import android.content.ContentValues;
import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

public class DatabaseHandler extends SQLiteOpenHelper 
{
	// All Static variables
    // Database Version
    private static final int DATABASE_VERSION = 1;
 
    // Database Name
    private static final String DATABASE_NAME = "DB";
 
    // Contacts table name
    private static final String TABLE_MINERAL = "MINERALDESC";
 
    // Contacts Table Columns names
    private static final String KEY_ID = "_ID";
    private static final String KEY_NAME = "NAME";
    private static final String KEY_DESC = "DESCRIPTION";
    private static final String KEY_PIC = "PICTURE";

	private SQLiteDatabase _db;
    
    public DatabaseHandler(Context context) {
        super(context, DATABASE_NAME, null, DATABASE_VERSION);
    }
    
	@Override
	public void onCreate(SQLiteDatabase db) {
		_db=db;
		String CREATE_MINERALS_TABLE = "CREATE TABLE " + TABLE_MINERAL + " (" + 
				KEY_ID + " INTEGER PRIMARY KEY AUTOINCREMENT, " + 
				KEY_NAME + " TEXT, " +
				KEY_DESC + " TEXT, " +
                KEY_PIC + " TEXT" + ")";
        _db.execSQL(CREATE_MINERALS_TABLE);
        
        //insert values
        addItem("אוכרה", "הופעה אבקתית של המינרל לימוניט", "Ochre.jpg");
        addItem("חרסית", "מינרלים יציבים, תוצרים של בלייה או של פעולת תמיסות מימיות חמות על פלדספטים  ומינרלים אחרים (אך לא קוורץ). נפוץ מאד בסלעי משקע. המינרל מאופיין בגביש זעיר הבנוי מסיליקה  ואלומינה ובנטייה לספוח מים.", "claystone.jpg");
        addItem("קאוליניט", "נוצר עקב בליה כימית של מינרלים אלומו־סיליקטיים הכוללים אלומיניום דוגמת פצלת השדה. בנוי משתי שכבות: שכבה אחת בנויה מטטרהדרונים של סיליקה. שלושה מתוך ארבעת אטומי החמצן שבסיליקה נמצאים במישור השכבה ומתחברים לאטומי חמצן של הטטרהדרונים האחרים באותה שכבה ויוצרים בכך רשת של משושים. אטום החמצן הרביעי בסיליקה מתקשר עם השכבה השנייה אשר בנויה מאוקטהדרונים שבמרכזם אלומיניום המוקפים באטומים של חמצן או בקבוצת ההידרוקסיל.  ", "kaolinite.jpg");
        addItem("גבס", "מינרל רך מאוד המורכב מסידן וגופרית. כאשר מחממים את הגבס מעל ל-150 מעלות צלזיוס מתאיידים 75% מהמים האגורים במבנה הכימי שלו. ", "geves.jpg");
        addItem("מוסקוביט", "נמצא בסלעי יסוד, סלעים מותמרים וסלעי משקע. למוסקוביט תפקיד משמעוי ביצירה של ההופעה הפצלית של סלעים מותמרים כצפחות. משקעים קלאסטיים שמקורם בסלע קריסטליני שלא עברו בליה או הסעה משמעותית בדרך כלל מכילים מוסקוביט, לכן מוסקוביט הוא מינרל נפוץ גם באבן החול ארקוזה ועוד.", "Muscovite.jpg");
        addItem("ביוטיט", "מינרל סיליקטי נפוץ המורכב מאשלגן, מגנזיום, ברזל ואלומיניום. מכונה לעתים נציץ ברזל ומצוי בגרניט ובסלעים המותמרים גנייס ושיסט. מתקלף בקלות לפתיתים אלסטיים. לעתים מוצאים יריעות גדולות שלו במיוחד בעורקים בתוך פגמטיטים. גבישים קטנים שעברו בליה מקבלים גוון זהוב מנצנץ ולכן הם אחד מסוגי זהב השוטים שהטעה רבים.", "Biotite.jpg");
        addItem("פירולוזיט", "מורכב בעיקר ממנגן (כ-60% מתכולת המינרל) דו חמצני והוא בצר חשוב של מנגן. זהו מינרל אמורפי, שחור ורך שמבנהו גרגרי, סיבי או עמודי כשלעתים הוא יוצר צורת כליה. המינרל מלכלך בקלות את הידיים באבקה שחורה. זהו תוצר התחמצנות של מינרלי מנגן שעברו בליה ונוצר גם בסלעי משקע שהם תוצר של לגונות רדודות של מים עומדים או של ביצות, לעתים בריכוז רב בצורת בצר. על פי רוב מופיע הפירולוזיט בכמות קטנה.", "Pyrolusite.jpg");
        addItem("גופרית", "גופרית בצורתה החופשית ניתן למצוא במעיינות חמים ואזורים געשיים במקומות רבים בעולם, במיוחד לאורך טבעת האש של האוקיינוס השקט. מרבץ משמעותי אחר של מלחי גופרית נמצא לאורך מפרץ מקסיקו. גופרית נמצאת במקומות נוספים בסלעי משקע, למשל במזרח אירופה ובמערב אסיה. מקור גופרית זו הוא בפעולה של חיידק אנארובי שחי על מינרלי גופרית, במיוחד גבס.", "Sulfur.jpg");
        addItem("קלציט", "מינרל קרבונטי והפולימורף היציב ביותר של סידן פחמתי. הוא אחד המינרלים הנפוצים ביותר על פני כדור הארץ ומהווה כ-4% ממסת קרום כדור הארץ. הקלציט מהווה את המרכיב עיקרי בסלעי משקע, בעיקר באבן גיר, והוא גם המינרל העיקרי בסלע המותמר שיש, כמו גם המינרל הבונה נטיפים וזקיפים במערות. הקלציט מהווה את המרכיב העיקרי בשלד החיצוני של הרבה יצורים ימיים כמו פלנקטון וצדפות.", "Calcite.jpg");
        addItem("הליט", "הליט הוא המינרל של מלח הבישול (נתרן כלורי) והוא שייך למשפחת ההלואידים. הליט מתגבש בשכבות נרחבות של מינרלים אוואפוריטיים כתוצאה מהתייבשות של אגמים או ימות סגורים. שכבות המלח עשויות להיות בעובי של עד 350 מטר ועשויות להימצא מתחת לשטחים נרחבים.", "helit.jpg");
        addItem("לימוניט", "מכיל לעתים כמויות משתנות של תחמוצות לעומת הידרוקסילים. יחד עם המטיט ומגנטיט, לימוניט הוא אחד מתחמוצות הברזל. נמצא בעיקר בתוך או ליד ברזל מחומצן או מרבצי מתכות אחרות. מקור השם לימוניט הוא במילה היוונית לאדמת מרעה, מכיוון שהוא מופיע לעתים באחו ומרחבים אחרים. לימוניט הוא מינרל פסאודומורפי, כלומר, הוא יכול להתגבש בתבנית של מינרל שקדם לו (פיריט לדוגמה) ולהשאר בצורה הגבישית החיצונית שלו. במקרים רבים גביש לימוניט נערך בצורת תחמוצות ברזל אחרות כמו המטיט, מגנטיט, פיריט או סידריט.", "Limonite.jpg");
        addItem("פיריט", "הברק המתכתי שלו וצבעו הקנו לו את הכינוי זהב השוטים, ולמרבה האירוניה לעתים אכן ניתן למצוא בו כמויות קטנות של זהב. פיריטים מסוימים נחשבים כעפרה משובחת להפקת זהב, ארסן, ניקל, קובלט ונחושת. בדרך כלל נמצא בעורקי קוורץ, סלעי משקע או סלעים מטמורפיים, כמו גם במרבצי פחם ומאובנים. פיריט שנחשף לאוויר ולמים במהלך חציבה מגיב עמם ליצירת חומצה גופרתית, תופעה מסוכנת במכרות.", "Pyrite.jpg");
        addItem("פירוקסן", "פירוקסן הוא קבוצה חשובה של מינרלים סיליקטיים בוני סלעים. מינרלים אלה נפוצים כחלק מסלעים מגמטיים (סלעי יסוד) וסלעים מותמרים רבים. הם נפוצים מאוד בסלעי בזלת וגברו.", "piroxen.jpg");
        addItem("אמפיבול", "דומים מאוד בהרכבם הכימי ובתכונותיהם הכלליות לקבוצת הפירוקסן, וכמותם הם ממויינים לשלוש סדרות בהתאם לצורת התגבשותם. ההבדל העיקרי בין אמפיבול לפירוקסן הוא בפצילות. הזווית בין מישורי הפצילות בקבוצת הפירוקסן היא ישרה בעוד שבקבוצת האמפיבול היא אינה כזו. כמו כן המשקל הסגולי של האמפיבול קטן מזה של הפירוקסן. אמפיבול הוא רכיב נפוץ בסלעי יסוד ובסלעים מותמרים רבים כדוגמת גרניט, סיאניט, דיוריט, גברו, בזלת, אנדזיט, גנייס וצפחה. זהו המינרל הראשי בסלע האמפיבוליט.", "amfibol.jpg");
        addItem("אוליווין", "מינרל הוא בעצם שורת מינרלים איזומורפיים, כלומר תרכובות דומות בהרכבן , שבהם כמויות משתנות של מגנזיום וברזל. הרכבן נע בין שני הקצוות: מפורסטריט המכיל מגנזיום בלבד, ועד פאיאליט המכיל ברזל בלבד. האגודה הבינלאומית למינרלוגיה אינה מכירה יותר בשם אוליבין כשם חוקי למינרל, אלא רק כתערובת בין פורסטריט לפאיאליט. על שם האוליבין קרויה קבוצת האוליבין, משפחה של מינרלים במבנה דומה.", "olivin.jpg");
        addItem("פלדשפר", "אחת מקבוצות המינרלים החשובות ביותר שמהם בנויים סלעי היסוד. הקבוצה קרויה בעברית גם קבוצת הפלדספּרים (שמה באנגלית) או גם פלדספטים. עד כ-60% מקרום כדור הארץ בנוי מפצלות השדה. פצלות השדה מתגבשות ממאגמה הן בסלעי תהום (סלעים פלוטוניים) והן בסלעי פרץ (סלעים וולקניים). פצלות השדה מצויות גם בסוגים רבים של סלעים מותמרים וסלעי משקע.", "feldshepr.jpg");
        addItem("מגנטיט", "המינרל המגנטי ביותר על כדור הארץ ומצפנים קדומים היו מורכבים ממנו. מגנטיט מתמוסס באיטיות בחומצת מימן כלורי וגרגריו נמצאים כמעט בכל סלעי היסוד וברוב סלעי המשקע, בנוסף לכך מגנטיט הוא מקור חשוב להפקת ברזל. גבישי מגנטיט נמצאו במספר בקטריות ובמוחן של דבורים, טרמיטים ומספר ציפורים (לדוגמה יונה). גם בבני אדם נמצא גביש מגנטיט זעיר באף. השערות מציעות שאורגניזמים מסוימים יכולים לחוש בשדה המגנטי של כדור הארץ בעזרת גבישי המגנטיט שמצויים בגופם וכך לנווט בו.", "Magnetite.jpg");
        addItem("קוורץ", "קוורץ הוא המינרל השני הנפוץ ביותר בקרום כדור הארץ. שייך לקבוצת המינרלים הסיליקטיים שהם הקבוצה החשובה ביותר בין המינרלים יוצרי הסלעים. קוורץ מצוי הן בסלעי יסוד כדוגמת הגרניט, סלעי משקע כדוגמת אבן הגיר וסלעים מותמרים כדוגמת שיסט. הקוורץ הוא המינרל האחרון בשורת בואן להתגבש (בטמפרטורה של כ-600 מעלות) כשמאגמה מתמצקת ליצירת סלעי יסוד. מקובל לסווג סלע מגמטי בהתאם לכמות הקוורץ שבו. מעל 10% קוורץ הוא סלע חומצי. 0%-10% הוא סלע בינוני, הסלעים הבסיסיים והאולטרא בסיסיים אינם מכילים קוורץ.", "Quartz.jpg");
	}
	
	//
	@Override
	public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) 
	{
		// Drop older table if existed
        db.execSQL("DROP TABLE IF EXISTS " + TABLE_MINERAL);
 
        // Create tables again
        onCreate(db);
	}
	
	// Adding new item
	boolean addItem(String name, String desc, String pic) 
	{
//		SQLiteDatabase db = this.getWritableDatabase();
		
		ContentValues values = new ContentValues();
		values.put(KEY_NAME, name);
		values.put(KEY_DESC, desc);
		values.put(KEY_PIC, pic);
		
	    // Inserting Row
	    long result = _db.insert(TABLE_MINERAL, null, values);
//	    db.close();
	    return (result > -1);
	}
}
