package il.ac.huji.mineralyzer;

import android.content.ContentValues;
import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

public class SqlHalper extends SQLiteOpenHelper {
	static Boolean init=false;
	public SqlHalper(Context context) {
		super(context, "mineral_db", null, 1);
	}

	@Override
	public void onCreate(SQLiteDatabase db) {
		db.execSQL("create table mineral ( _id integer primary key autoincrement,"
				+  " name text, hard text, color text, sf text );");
		addItem("אוכרה","נחרץ בציפורן","כתום","אבקתי",db);
		addItem("אוכרה","נחרץ בציפורן","אדום","אבקתי",db);
		addItem("אוכרה","נחרץ בציפורן","כתום","צובע את הידיים",db);
		addItem("אוכרה","נחרץ בציפורן","אדום","צובע את הידיים",db);
		
		addItem("חרסית","נחרץ בציפורן","ירוק","עיסתי בהירטבו במים",db);
		addItem("חרסית","נחרץ בציפורן","אפור","עיסתי בהירטבו במים",db);
		addItem("חרסית","נחרץ בציפורן","לבנבן","עיסתי בהירטבו במים",db);
		addItem("חרסית","נחרץ בציפורן","צהבהב","עיסתי בהירטבו במים",db);
		
		addItem("קאוליניט","נחרץ בציפורן","לבנבן","מסיבי",db);
		addItem("קאוליניט","נחרץ בציפורן","לבנבן","רך במישוש",db);
		addItem("קאוליניט","נחרץ בציפורן","לבנבן","נצמד ללשון",db);
		
		addItem("גבס","נחרץ בציפורן","חסר צבע","לווחי",db);
		addItem("גבס","נחרץ בציפורן","חסר צבע","שקוף עד אטום",db);
		addItem("גבס","נחרץ בציפורן","חסר צבע","סיבי או מסיבי",db);
		addItem("גבס","נחרץ בציפורן","חסר צבע","מפריש מים בעת חימום במבחנה",db);

		addItem("גבס","נחרץ בציפורן","לבן","לווחי",db);
		addItem("גבס","נחרץ בציפורן","לבן","שקוף עד אטום",db);
		addItem("גבס","נחרץ בציפורן","לבן","סיבי או מסיבי",db);
		addItem("גבס","נחרץ בציפורן","לבן","מפריש מים בעת חימום במבחנה",db);
		
		addItem("מוסקוביט","נחרץ בציפורן","חסר צבע","פציל מאוד ללוחות דקיקים וגמישים",db);
		addItem("מוסקוביט","נחרץ בציפורן","ורוד","פציל מאוד ללוחות דקיקים וגמישים",db);
		addItem("מוסקוביט","נחרץ בציפורן","לבנבן","פציל מאוד ללוחות דקיקים וגמישים",db);

		addItem("ביוטיט","נחרץ בציפורן","שחור","פציל מאוד ללוחות דקיקים וגמישים",db);
		addItem("ביוטיט","נחרץ בציפורן","ירוק","פציל מאוד ללוחות דקיקים וגמישים",db);
		addItem("ביוטיט","נחרץ בציפורן","חום","פציל מאוד ללוחות דקיקים וגמישים",db);
		

		addItem("פירולוזיט","נחרץ בציפורן","שחור","צובע את הידיים",db);
		addItem("פירולוזיט","נחרץ בציפורן","שחור","אבקתי",db);
		addItem("פירולוזיט","נחרץ בציפורן","שחור","לעיתים בגבישים מחטיים או מסיבי",db);
		

		addItem("גופרית","נחרץ בציפורן","צהוב","גרגרי",db);
		addItem("גופרית","נחרץ בציפורן","צהוב","אבקתי",db);
		addItem("גופרית","נחרץ בציפורן","צהוב","מסיבי",db);
		addItem("גופרית","נחרץ בציפורן","צהוב","נדלק על ידי גפרור",db);
		
		addItem("קלציט","נחרץ במסמר","חסר צבע","סיבי",db);
		addItem("קלציט","נחרץ במסמר","חסר צבע","מסיבי",db);
		addItem("קלציט","נחרץ במסמר","חסר צבע","תוסס בחומצה מלחית מהולה",db);
		addItem("קלציט","נחרץ במסמר","חסר צבע","רומבואדרים",db);

		addItem("קלציט","נחרץ במסמר","לבנבן","סיבי",db);
		addItem("קלציט","נחרץ במסמר","לבנבן","מסיבי",db);
		addItem("קלציט","נחרץ במסמר","לבנבן","תוסס בחומצה מלחית מהולה",db);
		addItem("קלציט","נחרץ במסמר","לבנבן","רומבואדרים",db);
		
		addItem("הליט","נחרץ במסמר","לבנבן","מלוח",db);
		addItem("הליט","נחרץ במסמר","לבנבן","קוביות",db);
		addItem("הליט","נחרץ במסמר","לבנבן","לעיתים שקוף",db);
		addItem("הליט","נחרץ במסמר","לבנבן","פציל לקוביות",db);
		
		addItem("הליט","נחרץ במסמר","חסר צבע","מלוח",db);
		addItem("הליט","נחרץ במסמר","חסר צבע","קוביות",db);
		addItem("הליט","נחרץ במסמר","חסר צבע","לעיתים שקוף",db);
		addItem("הליט","נחרץ במסמר","חסר צבע","פציל לקוביות",db);
		

		addItem("לימוניט","אינו נחרץ במסמר","חום","מסיבי",db);
		addItem("לימוניט","אינו נחרץ במסמר","חום","אמורפי",db);
		addItem("לימוניט","אינו נחרץ במסמר","חום","צבע האבקה חום או צהוב",db);
		
		addItem("לימוניט","אינו נחרץ במסמר","זהוב","מסיבי",db);
		addItem("לימוניט","אינו נחרץ במסמר","זהוב","אמורפי",db);
		addItem("לימוניט","אינו נחרץ במסמר","זהוב","צבע האבקה חום או צהוב",db);

		addItem("פיריט","אינו נחרץ במסמר","זהוב","ברק מתכתי",db);
		addItem("פיריט","אינו נחרץ במסמר","זהוב","קוביות",db);
		addItem("פיריט","אינו נחרץ במסמר","זהוב","גרגרי",db);
		addItem("פיריט","אינו נחרץ במסמר","זהוב","מסיבי",db);
		addItem("פיריט","אינו נחרץ במסמר","זהוב","דודקאדרונים",db);

		addItem("פירוקסן","אינו נחרץ במסמר","חום","סיבי",db);
		addItem("פירוקסן","אינו נחרץ במסמר","חום","מסיבי",db);
		addItem("פירוקסן","אינו נחרץ במסמר","חום","פריזמות",db);
		addItem("פירוקסן","אינו נחרץ במסמר","חום","פציל בשני כיוונים היוצרים זוויות ישרות",db);
		

		addItem("פירוקסן","אינו נחרץ במסמר","שחור","סיבי",db);
		addItem("פירוקסן","אינו נחרץ במסמר","שחור","מסיבי",db);
		addItem("פירוקסן","אינו נחרץ במסמר","שחור","פריזמות",db);
		addItem("פירוקסן","אינו נחרץ במסמר","שחור","פציל בשני כיוונים היוצרים זוויות ישרות",db);
		

		addItem("פירוקסן","אינו נחרץ במסמר","ירוק","סיבי",db);
		addItem("פירוקסן","אינו נחרץ במסמר","ירוק","מסיבי",db);
		addItem("פירוקסן","אינו נחרץ במסמר","ירוק","פריזמות",db);
		addItem("פירוקסן","אינו נחרץ במסמר","ירוק","פציל בשני כיוונים היוצרים זוויות ישרות",db);

		addItem("אמפיבול","אינו נחרץ במסמר","ירוק","סיבי",db);
		addItem("אמפיבול","אינו נחרץ במסמר","ירוק","מסיבי",db);
		addItem("אמפיבול","אינו נחרץ במסמר","ירוק","פריזמות",db);
		addItem("אמפיבול","אינו נחרץ במסמר","ירוק","פציל בשני כיוונים היוצרים זוויות אופייניות של 56 מעלות ו 124 מעלות",db);	

		addItem("אמפיבול","אינו נחרץ במסמר","שחור","סיבי",db);
		addItem("אמפיבול","אינו נחרץ במסמר","שחור","מסיבי",db);
		addItem("אמפיבול","אינו נחרץ במסמר","שחור","פריזמות",db);
		addItem("אמפיבול","אינו נחרץ במסמר","שחור","פציל בשני כיוונים היוצרים זוויות אופייניות של 56 מעלות ו 124 מעלות",db);	
		

		addItem("אוליווין","אינו נחרץ במסמר","ירוק","ברק זגוגי",db);
		addItem("אוליווין","אינו נחרץ במסמר","ירוק","גבישים גדולים יחסית בבזלת אך גם מסיבי",db);

		addItem("אוליווין","אינו נחרץ במסמר","חום","ברק זגוגי",db);
		addItem("אוליווין","אינו נחרץ במסמר","חום","גבישים גדולים יחסית בבזלת אך גם מסיבי",db);

		addItem("פלדשפר","אינו נחרץ במסמר","לבן","פריזמות מרובעות",db);
		addItem("פלדשפר","אינו נחרץ במסמר","לבן","מחטים או מסיבי",db);
		addItem("פלדשפר","אינו נחרץ במסמר","לבן","שכיח בסלעים מגמטיים",db);

		addItem("פלדשפר","אינו נחרץ במסמר","ורוד","פריזמות מרובעות",db);
		addItem("פלדשפר","אינו נחרץ במסמר","ורוד","מחטים או מסיבי",db);
		addItem("פלדשפר","אינו נחרץ במסמר","ורוד","שכיח בסלעים מגמטיים",db);

		addItem("פלדשפר","אינו נחרץ במסמר","צהבהב אפור","פריזמות מרובעות",db);
		addItem("פלדשפר","אינו נחרץ במסמר","צהבהב אפור","מחטים או מסיבי",db);
		addItem("פלדשפר","אינו נחרץ במסמר","צהבהב אפור","שכיח בסלעים מגמטיים",db);
		

		addItem("מגנטיט","אינו נחרץ במסמר","שחור","נמשך למגנט",db);
		addItem("מגנטיט","אינו נחרץ במסמר","שחור","קוביות",db);
		addItem("מגנטיט","אינו נחרץ במסמר","שחור","אוקטאדרים או מסיבי",db);

		addItem("קוורץ","אינו נחרץ במסמר","לבן","פריזמות משושות",db);
		addItem("קוורץ","אינו נחרץ במסמר","לבן","עורקים",db);
		addItem("קוורץ","אינו נחרץ במסמר","לבן","תרכיזים",db);
		addItem("קוורץ","אינו נחרץ במסמר","לבן","מסיבי",db);
		addItem("קוורץ","אינו נחרץ במסמר","לבן","ברק זגוגי",db);

		addItem("קוורץ","אינו נחרץ במסמר","חסר צבע","פריזמות משושות",db);
		addItem("קוורץ","אינו נחרץ במסמר","חסר צבע","עורקים",db);
		addItem("קוורץ","אינו נחרץ במסמר","חסר צבע","תרכיזים",db);
		addItem("קוורץ","אינו נחרץ במסמר","חסר צבע","מסיבי",db);
		addItem("קוורץ","אינו נחרץ במסמר","חסר צבע","ברק זגוגי",db);
		
		
		
	}
	// Adding new item
	boolean addItem(String name, String hard, String color,String sf,SQLiteDatabase db) 
	{
//		SQLiteDatabase db = this.getWritableDatabase();

		ContentValues values = new ContentValues();
		values.put("name", name);
		values.put("hard", hard);
		values.put("color", color);

		values.put("sf", sf);

		// Inserting Row
		long result = db.insert("mineral", null, values);
//		db.close();
		return (result > -1);
	}

	@Override
	public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {
		// Drop older table if existed'
        db.execSQL("DROP TABLE IF EXISTS mineral");
 
        // Create tables again
        onCreate(db);
	}
}