package il.ac.huji.mineralyzer;

import android.content.ContentValues;
import android.content.Context;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

public class SqlHalper extends SQLiteOpenHelper {
	static Boolean init=false;
	public SqlHalper(Context context) {
		super(context, "mineral_db", null, 1);
	}

	@Override
	public void onCreate(SQLiteDatabase db) {
		db.execSQL("create table mineral ( _id integer primary key autoincrement,"
				+  " name text, hard text, color text, sf text );");
		
		addItem("סמקטיט-איליט","נחרץ בציפורן","ירוק","עיסתי בהירטבו במים",db);
		addItem("סמקטיט-איליט","נחרץ בציפורן","אפור","עיסתי בהירטבו במים",db);
		addItem("סמקטיט-איליט","נחרץ בציפורן","לבן","עיסתי בהירטבו במים",db);
		addItem("סמקטיט-איליט","נחרץ בציפורן","צהוב","עיסתי בהירטבו במים",db);
		
		addItem("קאוליניט","נחרץ בציפורן","לבן","מסיבי",db);
		addItem("קאוליניט","נחרץ בציפורן","לבן","רך במישוש",db);
		addItem("קאוליניט","נחרץ בציפורן","לבן","נצמד ללשון",db);
		
		addItem("גבס","נחרץ בציפורן","חסר צבע","לווחי",db);
		addItem("גבס","נחרץ בציפורן","חסר צבע","שקוף עד אטום",db);
		addItem("גבס","נחרץ בציפורן","חסר צבע","סיבי או מסיבי",db);
		addItem("גבס","נחרץ בציפורן","חסר צבע","מפריש מים בעת חימום במבחנה",db);

		addItem("גבס","נחרץ בציפורן","לבן","לווחי",db);
		addItem("גבס","נחרץ בציפורן","לבן","שקוף עד אטום",db);
		addItem("גבס","נחרץ בציפורן","לבן","סיבי או מסיבי",db);
		addItem("גבס","נחרץ בציפורן","לבן","מפריש מים בעת חימום במבחנה",db);
		
		addItem("מוסקוביט","נחרץ בציפורן","חסר צבע","פציל מאוד ללוחות דקיקים וגמישים",db);
		addItem("מוסקוביט","נחרץ בציפורן","ורוד","פציל מאוד ללוחות דקיקים וגמישים",db);
		addItem("מוסקוביט","נחרץ בציפורן","לבן","פציל מאוד ללוחות דקיקים וגמישים",db);

		addItem("ביוטיט","נחרץ בציפורן","שחור","פציל מאוד ללוחות דקיקים וגמישים",db);
		addItem("ביוטיט","נחרץ בציפורן","ירוק","פציל מאוד ללוחות דקיקים וגמישים",db);
		addItem("ביוטיט","נחרץ בציפורן","חום","פציל מאוד ללוחות דקיקים וגמישים",db);
		
		addItem("גופרית","נחרץ בציפורן","צהוב","גרגרי",db);
		addItem("גופרית","נחרץ בציפורן","צהוב","אבקתי",db);
		addItem("גופרית","נחרץ בציפורן","צהוב","מסיבי",db);
		addItem("גופרית","נחרץ בציפורן","צהוב","נדלק על ידי גפרור",db);
		
		addItem("קלציט","נחרץ במסמר","חסר צבע","סיבי",db);
		addItem("קלציט","נחרץ במסמר","חסר צבע","מסיבי",db);
		addItem("קלציט","נחרץ במסמר","חסר צבע","תוסס בחומצה מלחית מהולה",db);
		addItem("קלציט","נחרץ במסמר","חסר צבע","רומבואדרים",db);

		addItem("קלציט","נחרץ במסמר","לבן","סיבי",db);
		addItem("קלציט","נחרץ במסמר","לבן","מסיבי",db);
		addItem("קלציט","נחרץ במסמר","לבן","תוסס בחומצה מלחית מהולה",db);
		addItem("קלציט","נחרץ במסמר","לבן","רומבואדרים",db);
		
		addItem("הליט","נחרץ במסמר","לבן","מלוח",db);
		addItem("הליט","נחרץ במסמר","לבן","קוביות",db);
		addItem("הליט","נחרץ במסמר","לבן","לעיתים שקוף",db);
		addItem("הליט","נחרץ במסמר","לבן","פציל לקוביות",db);
		
		addItem("הליט","נחרץ במסמר","חסר צבע","מלוח",db);
		addItem("הליט","נחרץ במסמר","חסר צבע","קוביות",db);
		addItem("הליט","נחרץ במסמר","חסר צבע","לעיתים שקוף",db);
		addItem("הליט","נחרץ במסמר","חסר צבע","פציל לקוביות",db);
		
		addItem("לימוניט","נחרץ בזכוכית","חום","מסיבי",db);
		addItem("לימוניט","נחרץ בזכוכית","חום","אמורפי",db);
		addItem("לימוניט","נחרץ בזכוכית","חום","צבע האבקה חום או צהוב",db);
		
		addItem("לימוניט","נחרץ בזכוכית","זהוב","מסיבי",db);
		addItem("לימוניט","נחרץ בזכוכית","זהוב","אמורפי",db);
		addItem("לימוניט","נחרץ בזכוכית","זהוב","צבע האבקה חום או צהוב",db);

		addItem("פיריט","נחרץ בזכוכית","זהוב","ברק מתכתי",db);
		addItem("פיריט","נחרץ בזכוכית","זהוב","קוביות",db);
		addItem("פיריט","נחרץ בזכוכית","זהוב","גרגרי",db);
		addItem("פיריט","נחרץ בזכוכית","זהוב","מסיבי",db);
		addItem("פיריט","נחרץ בזכוכית","זהוב","דודקאדרונים",db);

		addItem("פירוקסן","נחרץ בזכוכית","חום","סיבי",db);
		addItem("פירוקסן","נחרץ בזכוכית","חום","מסיבי",db);
		addItem("פירוקסן","נחרץ בזכוכית","חום","פריזמות",db);
		addItem("פירוקסן","נחרץ בזכוכית","חום","פציל בשני כיוונים היוצרים זוויות ישרות",db);

		addItem("פירוקסן","נחרץ בזכוכית","שחור","סיבי",db);
		addItem("פירוקסן","נחרץ בזכוכית","שחור","מסיבי",db);
		addItem("פירוקסן","נחרץ בזכוכית","שחור","פריזמות",db);
		addItem("פירוקסן","נחרץ בזכוכית","שחור","פציל בשני כיוונים היוצרים זוויות ישרות",db);

		addItem("פירוקסן","נחרץ בזכוכית","ירוק","סיבי",db);
		addItem("פירוקסן","נחרץ בזכוכית","ירוק","מסיבי",db);
		addItem("פירוקסן","נחרץ בזכוכית","ירוק","פריזמות",db);
		addItem("פירוקסן","נחרץ בזכוכית","ירוק","פציל בשני כיוונים היוצרים זוויות ישרות",db);

		addItem("אמפיבול","נחרץ בזכוכית","ירוק","סיבי",db);
		addItem("אמפיבול","נחרץ בזכוכית","ירוק","מסיבי",db);
		addItem("אמפיבול","נחרץ בזכוכית","ירוק","פריזמות",db);
		addItem("אמפיבול","נחרץ בזכוכית","ירוק","פציל בשני כיוונים היוצרים זוויות אופייניות",db);	

		addItem("אמפיבול","נחרץ בזכוכית","שחור","סיבי",db);
		addItem("אמפיבול","נחרץ בזכוכית","שחור","מסיבי",db);
		addItem("אמפיבול","נחרץ בזכוכית","שחור","פריזמות",db);
		addItem("אמפיבול","נחרץ בזכוכית","שחור","פציל בשני כיוונים היוצרים זוויות אופייניות",db);	
		
		addItem("אוליבין","נחרץ בזכוכית","ירוק","ברק זגוגי",db);
		addItem("אוליבין","נחרץ בזכוכית","ירוק","גבישים גדולים יחסית בבזלת אך גם מסיבי",db);

		addItem("אוליבין","נחרץ בזכוכית","חום","ברק זגוגי",db);
		addItem("אוליבין","נחרץ בזכוכית","חום","גבישים גדולים יחסית בבזלת אך גם מסיבי",db);

		addItem("פלדספר","נחרץ בזכוכית","לבן","פריזמות מרובעות",db);
		addItem("פלדספר","נחרץ בזכוכית","לבן","מחטים או מסיבי",db);
		addItem("פלדספר","נחרץ בזכוכית","לבן","שכיח בסלעי יסוד",db);

		addItem("פלדספר","נחרץ בזכוכית","ורוד","פריזמות מרובעות",db);
		addItem("פלדספר","נחרץ בזכוכית","ורוד","מחטים או מסיבי",db);
		addItem("פלדספר","נחרץ בזכוכית","ורוד","שכיח בסלעי יסוד",db);

		addItem("פלדספר","נחרץ בזכוכית","צהוב אפור","פריזמות מרובעות",db);
		addItem("פלדספר","נחרץ בזכוכית","צהוב אפור","מחטים או מסיבי",db);
		addItem("פלדספר","נחרץ בזכוכית","צהוב אפור","שכיח בסלעי יסוד",db);
		
		addItem("מגנטיט","נחרץ בזכוכית","שחור","נמשך למגנט",db);
		addItem("מגנטיט","נחרץ בזכוכית","שחור","קוביות",db);
		addItem("מגנטיט","נחרץ בזכוכית","שחור","אוקטאדרים או מסיבי",db);

		addItem("קוורץ","נחרץ בזכוכית","לבן","פריזמות משושות",db);
		addItem("קוורץ","נחרץ בזכוכית","לבן","עורקים",db);
		addItem("קוורץ","נחרץ בזכוכית","לבן","תרכיזים",db);
		addItem("קוורץ","נחרץ בזכוכית","לבן","מסיבי",db);
		addItem("קוורץ","נחרץ בזכוכית","לבן","ברק זגוגי",db);

		addItem("קוורץ","נחרץ בזכוכית","חסר צבע","פריזמות משושות",db);
		addItem("קוורץ","נחרץ בזכוכית","חסר צבע","עורקים",db);
		addItem("קוורץ","נחרץ בזכוכית","חסר צבע","תרכיזים",db);
		addItem("קוורץ","נחרץ בזכוכית","חסר צבע","מסיבי",db);
		addItem("קוורץ","נחרץ בזכוכית","חסר צבע","ברק זגוגי",db);
		
		
		addItem("דולומיט","נחרץ במסמר","לבן-אפור","מנצנץ בשמש",db);
		addItem("דולומיט","נחרץ במסמר","צהוב-חום","מנצנץ בשמש",db);
		
		addItem("דולומיט","נחרץ במסמר","לבן-אפור","תסיסה אחרי שחיקת הסלע",db);
		addItem("דולומיט","נחרץ במסמר","צהוב-חום","תסיסה אחרי שחיקת הסלע",db);
		
		addItem("דולומיט","נחרץ במסמר","לבן-אפור","תסיסה אם נחמם את החומצה",db);
		addItem("דולומיט","נחרץ במסמר","צהוב-חום","תסיסה אם נחמם את החומצה",db);
	}
	
	// Adding new item
	boolean addItem(String name, String hard, String color,String sf,SQLiteDatabase db) 
	{
//		SQLiteDatabase db = this.getWritableDatabase();

		ContentValues values = new ContentValues();
		values.put("name", name);
		values.put("hard", hard);
		values.put("color", color);

		values.put("sf", sf);

		// Inserting Row
		long result = db.insert("mineral", null, values);
//		db.close();
		return (result > -1);
	}

	@Override
	public void onUpgrade(SQLiteDatabase db, int oldVersion, int newVersion) {
		// Drop older table if existed'
        db.execSQL("DROP TABLE IF EXISTS mineral");
 
        // Create tables again
        onCreate(db);
	}
}